inherit ROOM;

void create()
{
	set("short", "大中桥");
	set("long", @LONG
此桥系由大桥淮清桥及中桥四象桥合并而成，故合称大中桥。此桥原为白下桥
。唐高祖武德九年迁金陵县治于此，改名白下县，城东门便为白下门，城门前青溪
上为白下桥。旁有驿亭“白下亭”，与白下门隔河相对，垂柳映青溪，芳草碧连天
，为金陵十八景。乃文人雅士送往迎来和饯别之所。李太白曾寓居于此。有诗“驿
亭三杨村，正当白下门。”宋建康府城仍沿南唐旧制，白下桥和白下亭仍在。王安
石罢相居半山园，从东门入城，必经此，曾云“门前秋水可扬舲，有意西寻白下亭
”。接东坡来游钟山，饯行于白下桥，赋诗：“穷源莫过青溪口，送客每经白下桥
”。还写下了“东门白下亭，摧甓蔓寒葩”等诗句。亭边建有白下寺，匾额为寇准
所书。文天祥赴元大都曾住白下亭内。
LONG );
	set("exits", ([
		"west"  : __DIR__"road_long5",
		"north" : __DIR__"bridge_fucheng",
		"south" : __DIR__"shop_liji",
		"east" : __DIR__"road_chongli1",
	]));
        set("outdoors", "nanjing");
	setup();
	replace_program(ROOM);
}

