inherit ROOM;

void create()
{
	set("short", "文华殿");
	set("long", @LONG
文华殿始建于国朝初年，与武英殿东、西相对。由于文华殿位于紫禁城东路
，并且曾一度作为「太子视事之所」。这里起初是皇帝常御之便殿，天顺、成化
朝，太子践祚以前，首先摄事于文华殿。根据五行说，东方属木，其色为绿，代
表生长，所以原先宫殿屋顶覆盖绿琉璃瓦。后来由于众太子大多年幼，无法参与
政事，嘉靖十五年将文华殿仍改为皇帝便殿，后来作为经筵之所，文华殿建筑随
之由绿琉璃瓦顶改为黄琉璃瓦顶。文华殿主殿平面呈工字形，分为前后两殿，中
间有穿廊相连。前殿即文华殿，坐北朝南，面阔五间，进深三间，黄琉璃瓦歇山
顶。明间开六扇三交六椀菱花槅扇门，次间、梢间都是槛窗，各开四扇三交六椀
菱花槅扇窗。东、西山墙各开一个方窗。文华殿前有月台，月台前方有一条甬路
连接文华门。
LONG );
	set("exits", ([
		"west" : __DIR__"gov_fengtian",
		"east" : __DIR__"road_gongdong4",
		"north" : __DIR__"gov_taisun",
		"south" : __DIR__"gov_wenyuan",
	]));
	set("objects", ([
		__DIR__"npc/bing_dahan" : 2,
	]));
	setup();
	replace_program(ROOM);
}

