inherit ROOM;

void create()
{
	set("short", "内府诸库");
	set("long", @LONG
此地有内承运库、司钥库、供用库、外承运库、宝钞广惠库、广积库、赃罚库
、甲、乙、丙、丁与戊字库，共十二库。其中，前三者由内官管理，后九者由文官
管理并隶户部。内承运库掌收支缎匹、金、银、珠玉、象牙诸宝货之物，及同司钥
库掌钞锭之数；司钥库掌皇城各门管钥及收支钱钞之事；内府供用库掌御用香米及
内用香烛、油、米并内官诸人饮食、果实之类；外承运库掌收金、银、缎匹等物，
甲字库掌收铜钱、布匹、颜料，乙字库掌收衣服、衾帐、纸札等物，丙字库掌收丝
、绵、纱线，丁字库掌收铜、铁、锡、香、茶、蜡诸物，戊字库掌收氊衫、胡椒并
支收军器，广源库掌收贮宝钞，广惠库掌收支宝钞。
LONG );
	set("exits", ([
		"north" : __DIR__"gov_zhuku1",
		"south" : __DIR__"gov_zhuku3",
		"west" : __DIR__"road_huangxi3",
	]));
	setup();
	replace_program(ROOM);
}

