//Cracked by Roath
inherit NPC_SAVE;
string *title=({"虚日星君",
		"斗木星君",
		"女土星君",
		"牛金星君",
		"壁水星君",
		"室火星君",
		"危月星君",
		"昂日星君",
		"奎木星君",
		"胃土星君",
		"娄金星君",
		"参水星君",
		"觜火星君",
		"毕月星君",
		"星日星君",
		"井木星君",
		"柳土星君",
		"鬼金星君",
		"轸水星君",
		"翼火星君",
		"张月星君",
		"房日星君",
		"角木星君",
		"氐土星君",
		"亢金星君",
		"箕水星君",
		"尾火星君",
		"心月星君",
});

string *long=({
"面如蓝碘多威武，赤发金睛恶如虎\n呼风唤雨不寻常，斩将封为虚日鼠\n", 
"九扬纱巾头上盖，腹内玄机无比赛\n降龙伏虎似平常，斩将封为斗木豸\n",
"跨虎登山观鹤鹿，驱邪捉怪神鬼哭\n只因无福了仙家，斩将封为女土蝠\n",
"五岳三山任意游，访玄参道守心修\n空劳炉内金丹汞，斩将封为牛金牛\n",
"五行妙术体全殊，合就玄中自丈夫\n悟道成仙无造化，斩将封为碧水狳\n",
"截教传来转玉枢，玄机两记用功夫\n丹砂鼎内龙降虎，斩将封为室火猪\n",
"发似朱砂脸似靛，浑身上下金光现\n天机玄妙总休言，斩将封为危月燕\n",
"铁树开花怎得齐，阴神行乐跨虹霓\n只因无福为仙侣，斩将封为昂日鸡\n",
"三柳钢须一尺长，炼就三花不老方\n蓬莱仙岛无心恋，斩将封为奎木狼\n",
"顶上详光五彩气，包罗万象多伶俐\n无分无缘成正果，斩将封为胃土雉\n",
"离龙坎虎相匹遇，炼就神丹成不朽\n无缘顶上现三花，斩将封为娄金狗\n",
"出世虔诚悟道言，勤修苦炼反离魂\n移山倒海任吾意，斩将封为参水猿\n",
"不恋尘华止自修，降龙伏虎任悠游\n空为数载丹砂力，斩将封为觜火猴\n",
"道术精奇盖世无，修真炼性握兵符\n长生妙诀贪尘劫，斩将封为毕月乌\n",
"修成大道真潇洒，妙法玄机有真假\n不能成仙却凡尘，斩将封为星日马\n",
"修成道气精光焕，巨口獠牙红发乱\n碧游宫内有声名，斩将封为井木犴\n",
"采练阴阳有异方，五行撰簇配中黄\n不归阐教归截教，斩将封为柳土獐\n",
"腹内珠玑贯八方，包罗万象道汪洋\n只因杀戒难逃躲，斩将封为鬼金羊\n",
"箬冠道服性聪敏，炼就白气无心损\n只因无福了长生，斩将封为轸水蚓\n",
"秘授口诀伏妖邪，顶上灵云天地遮\n三花聚顶难成就，斩将封为翼火蛇\n",
"腹内玄机修二六，炼就阴阳超凡俗\n谁知无气未朝元，斩将封为张月鹿\n",
"三昧真火空中露，霞光前后生百步\n万仙阵内逞英雄，斩将封为房日兔\n",
"一字青纱脑后飘，道袍水合束丝绦\n原神一现神龟灭，斩将封为角木狡\n",
"赤发红须性情俄，游尽三山并五岳\n包罗万象枉徒劳，斩将封为氏土狍\n",
"金丹炼就脱樊笼，五遁三除大道通\n未灭三尸吞六气，斩将封为亢金龙\n",
"自从修炼玄中妙，不恋金章共紫诰\n通天教主是吾师，斩将封为箕水豹\n",
"碧玉霞冠形容古，双手善把天地补\n无心访道学长生，斩将封为尾火虎\n",
"面如赤枣落腮胡，撒豆成岳盖世无\n两足登云如挚电，斩将封为心月狐\n",
});

void create()
{
	string tt, ll;
	tt = title[ID];
	ll = long[ID];

        set_name("星君", ({"xing jun", "star"}));
	set("title", tt);
	set("long", ll);
	set("gender", "男性");
	set("class", "xian");
	set("age", 20);
	set("per", 30);
	set("no_check", 1);	
	set("combat_exp", 1000000);
	set("daoxing", 1000000);

	setup();
	carry_object("/d/obj/cloth/xianpao")->wear();
	reload("star"+ID);
}

void init()
{
	object ob;
	ob=this_player();
	::init();
	
	if( wizardp(ob) && !this_object()->query("have_name") ){
		tell_object(ob,"如果此星君尚未命名，请用(setname 姓名)。\n");
	}
	add_action("setname", "setname");
	return;
}

int setname(string arg)
{
	object ob;
	ob=this_player();

	if(!wizardp(ob))
		return notify_fail("什么？\n");

	if(!arg)
		return notify_fail("请用(setname 姓名)。\n");

	tell_object(ob, "姓名改动成功。\n");
	this_object()->set("have_name", 1);
	this_object()->set("name", arg);
	this_object()->save();
	return 1;
}
