
   string *strs=({
        "\n\n                   "YEL"大　　话　　西　　游\n"NOR,
        "观  音：孙悟空，你这个畜牲，你本来答应如来佛祖护送你师傅唐三藏\n"
        "        去取西经，你居然跟牛魔王串通起来要吃你师傅，你知不知道\n"
        "        你犯了弥天大罪？\n",
        "孙悟空：少罗嗦！你追了我三天三夜，因为你是女人我才不杀你，不要\n"
        "        以为我怕了你了！\n",
        "唐  僧：悟空，你怎么可以这样跟观音姐姐讲话呢？\n",
        "悟  空：哗！不要吵！\n",
        "唐  僧：你又在吓我！\n",
        "观  音：你不是怕我又为什么要打伤紫霞仙子抢走她的月光宝盒，你不\n"
        "        就是想躲开我吗？\n",
        "悟  空：既然躲不了那老孙就跟你绝一死战！\n",
        "\n      (悟空将月光宝盒随手一抛，正好砸在唐僧头上。)\n\n",
        "唐  僧：又干什么？\n",
        "\n      (俩人正要动手，突然……)\n\n",
        "唐  僧：喂喂喂！大家不要生气，生气会犯了嗔戒的！悟空你也太调皮\n"
        "        了，我跟你说过叫你不要乱扔东西，你怎么又…你看我还没说\n"
        "        完你又把棍子给扔掉了！月光宝盒是宝物，你把他扔掉会污染\n"
        "        环境，要是砸到小朋友怎么办？就算砸不到小朋友砸到那些花\n"
        "        花草草也是不对的！\n",
        "\n      (悟空一把抓住唐僧手中的月光宝盒)\n\n",
        "唐  僧：干什么？\n",
        "悟  空：放手！\n",
        "唐  僧：你想要啊？悟空，你要是想要的话你就说话嘛，你不说我怎么\n"
        "        知道你想要呢，虽然你很有诚意地看着我，可是你还是要跟我\n"
        "        说你想要的。你真的想要吗？那你就拿去吧！你不是真的想要\n"
        "        吧？难道你真的想要吗？……\n",
        "悟  空：我Kao！\n"
        "\n           (悟空一拳将唐僧打倒。)\n\n",
        "观  音：啊？孙悟空！\n"
        "悟  空：大家看到啦？这个家伙没事就长篇大论婆婆妈妈叽叽歪歪，就\n"
        "        好象整天有一只苍蝇，嗡……对不起，不是一只，是一堆苍蝇\n"
       "\n       (悟空倒地翻滚，异常痛苦。)\n\n",
       "悟  空：所以呢我就抓住苍蝇挤破它的肚皮把它的肠子扯出来再用它的\n"
       "        肠子勒住他的脖子用力一拉，呵－－！整条舌头都伸出来啦！\n"
       "        我再手起刀落哗－－！整个世界清净了。现在大家明白，为什\n"
       "        么我要杀他！\n",
       "观  音：哼！悟空，你诸多借口，你根本就不想去取西经！\n",
       "悟  空：说那么多干什么，打呀！\n",
       "\n       (俩人一番斗法，悟空被观音降服收入甘露瓶。)\n\n"
       "观  音：今天我要替天行道！\n",
       "唐  僧：喂喂喂！徒弟有错做师傅的也有责任，求姐姐放他一条生路吧！\n",
       "观  音：我不消灭他我没法向玉皇大帝交代！\n",
       "唐  僧：请姐姐向玉皇大帝说一声，贫僧愿意一命赔一命！(合十坐地，\n"
       "        将法杖向空中一抛)喃呒阿弥陀佛！\n"
       "\n        (法杖将唐僧砸死。)\n\n",
        });

string *str1=({
"\n\n                   [1;32m悟空三打白骨精[m                \n",

        "话说这一日，唐僧师徒四人来到了一座大山脚下。\n" 
        "唐僧：徒儿，这里是个什么去处？真是太~~~~~好看啦！\n",
        "悟空：师傅，离开东土大唐已经好几年了，你怎么还是这个样子？\n"
        "      一座石头山而已，有什么好看的？说你是土鳖，又怕观音姐\n"
        "      姐骂我，在这座山上随便找一块石头都比你有见识！像你这\n"
        "      样怎么罩的住大家？我们好赖也会一点法术，就连你骑的那\n"
        "      匹马也一下子就把你踢翻了，你除了没完没了的给我们找麻\n"
        "      烦，拜托你也学一点别的本事！ \n",
        "唐僧：靠！我只不过是随便舒了一下情，你就这么婆婆妈妈、唧唧\n"
        "      歪歪、罗里罗唆，你还想不想混了？ \n",
        "沙僧：好了好了，大家都是出来给观音如来打工的，何必呢？\n",
        "唐僧：我和你大师兄说话什么时候轮到你插嘴了？为了扳你这\n"
        "      个毛病，我已经把你大师兄的金箍戴在了你头上，你又\n"
        "       来？\n",
        "沙僧：ok！我闭嘴先！\n",
        "唐僧：八戒，为师的又该说说你了。虽然你最近减肥有些成效，\n"
        "      虽然沙僧不喜欢和别人争辩，可你就看在他肩上挑着行\n"
        "      李的份上……你就别这样了。\n",
        "八戒：我这也是为了大家好啊！我老猪一走路就容易饿，就免\n"
        "      不了让大家去化斋，就免不了耽误了取经的时日。\n",
        "唐僧：那是我错怪你了，你就继续在你师弟脖子上骑着吧。\n",
        "沙僧：#￥@$^唐僧：悟空，让他这么一说，我还真有些饿\n"
        "      了，就劳烦你走一趟吧！\n",
        "悟空：又是我？轮也轮到你去了吧？\n"
        "唐僧：从理论上来讲，我应该去化斋的，可人家这两天…\n"
        "      …不太方便……\n"
        "\n　　[1;35m（集体晕倒）[m\n",
        "悟空：好，我去！\n",
        "八戒：等一等，万一一会儿来个什么人啊妖啊的，来劫色\n"
        "      怎么办？\n",
        "沙僧：拜托，你看看我们一个个光头的光头，大胡子的大\n"
        "      胡子，什么人妖敢来劫我们啊？\n",
        "八戒：变态！\n",
        "沙僧：啊？这也被你看出来了？没错，我的胡子是贴上的\n"
        "      ，我觉得作为一个男人嘛……\n",
        "八戒：stop！我是说变态会来劫我们啊！\n",
        "唐僧：是啊！悟空，这荒郊野外的，难免会有什么东东出\n"
        "      来，你看……\n",
        "悟空：真是麻烦哪！早知道这样，我就自己去取经了。还\n"
        "      好我早有准备，看！\n"
        "（众人）：啊！是电网！\n",
        "悟空：不错！这就是保镖牌电网，它耗电少，易操作，电\n"
        "      压可调，安全性高，更有交直流两用的型号，独有\n"
        "      的漏电保护装置，特别适合家中有小孩的家庭，他\n"
        "      的独特折叠设计，更便于携带，是居家旅游必备之\n"
        "      佳品！而且不贵呦！从现在开始只要您拨打我们的\n"
        "      直销免费电话，我们的工作人员会在24小时内为您\n"
        "      免费上门安装调试！并会送你一个精美的电动耳挖勺！\n",
        "沙僧：大师兄，我知道了，我有带电池耶！\n",
        "悟空：乖！~~~~~老孙这就去也！\n",
        "唐僧：等一等！悟空，你把沙僧背的水缸带上，这次你多\n"
        "      化些斋饭来，为师的有些饿了！\n",
        "悟空：……了解！\n"
        "\n[1;35m　　（与此同时，在此山的山洞里白骨精一家三口正在看电视）[m\n",
        "白爸爸：电视节目真是没意思，一天到晚也没什么好看的\n"
        "        。从买回家后我还没见过他放点别的！\n",
        "白儿子：早就告诉你应该装一条天线的，本来就是在大山\n"
        "        里，没有信号，当然就只有雪花看了。\n",
        "白妈妈：依我看，到了晚上它的用处会大一些，只要关掉\n"
        "        声音，咱们可以用它来当台灯嘛！\n",
        "白儿子：嘘……好像有声音耶！\n",
        "白妈妈：准是你爸爸大便完洗手时没有关好水龙头。\n",
        "白爸爸：靠！我已经三个多月没有吃人了，哪来的大便啊\n"
        "        ？说实在的，现在要是有大便我都想吃了！\n",
        "白儿子：两个白痴，看报纸了么？《西游日报》上说唐僧\n"
        "        就要来了！吃了他的肉，不但可以延年益寿，长\n"
        "        生不老，还可以止咳化痰、清咽润喉，上天安排\n"
        "        的机会，我们没有理由错过的！\n",
        "白爸爸：金嗓子喉宝？快出去看看先！\n",
        "白儿子：不过听说唐僧手下有个黑社会性质的社团组织，\n"
        "        为首的孙悟空是五百年前大闹凤来楼的齐天大圣！\n",
        "白妈妈：齐天大圣？是星驰虚拟社区里的那个么？我知道的。\n",
        "白儿子：那个是假的啦，你再乱插嘴小心我插~~~~~~~~~爆\n"
        "        你的眼睛！诶！真是没办法，你们先把水烧开，我\n"
        "        去看看先！\n",
        "白爸爸：小心啊！儿子！\n"
        "\n     （白儿子来到了唐僧休息的地方……）\n",
        "白儿子：师傅们好！\n",
        "唐僧：  小朋友好，你一个人在干什么呢？\n",
        "白儿子：我回家，前面不远就是我家了，我爸爸妈妈做好了\n"
        "        饭菜等我回家吃饭呢！\n",
        "八戒：  什么？有饭菜？师傅，大师兄好久也不回来，干脆咱\n"
        "        们跟小家伙一起回家算了。\n",
        "唐僧：  你也太无礼了，人家都没要我们去，为师怎好意思开\n"
        "         口？你一个老猪向人家小朋友讨饭，你惭不惭愧呀！\n",
        "白儿子：没关系，我家也是信佛的，我父母一定会很高兴大家\n"
        "        一起去的。\n",
        "唐僧：  哦？你家还有别人么？\n",
        "白儿子：我家只有我们三人。\n",
        "唐僧：  真是一对夫妻一个娃，即利国来又利家啊！沙僧，你\n"
        "        把电网收好，我们不等悟空了。\n"
        "\n　　（这时悟空恰好赶回来了）\n",
        "悟空：  呔！吃俺老孙一棒！\n",
        "唐僧：  住手！你打小朋友我就不说你什么了，可是你也应该\n"
        "        瞄得准一些呀？你差一点就打到我了！\n",
        "悟空：  对不起！对不起！我重新打过。呔！吃俺老孙一棒！\n",
        "白儿子：啊！（当场毙命）（心想：靠！太倒霉了，说什么儿\n"
        "        童是未来的主人翁，为什么先死的是我！）\n",
        "八戒：  不得了啦！大师兄打死人啦！\n"
        "沙僧：  哼！少见多怪！\n"
        "唐僧：  八戒，你大师兄一路上已经杀了这么多生灵，你叫个\n"
        "        头啊！不过悟空，这次你可错了，我刚才问过这个小\n"
        "        朋友，他家里一家三口，他是独生子，不是计划外生\n"
        "        育，你不应该杀他。\n",
        "悟空：师傅，这方圆百里哪来的人家？\n"
        "唐僧：也许是露营的呢？\n"
        "悟空：露你老母！\n"
        "唐僧：你敢骂我！\n"
        "悟空：要不是看在观音菩萨的份上，我还要打你呢！\n"
        "唐僧：◎※▲△＠＆＃■☆§〓◆◇……（紧箍咒）\n"
        "沙僧：师傅莫念！\n"
        "唐僧：SORRY！我忘记金箍在你头上了。\n"
        "悟空：看你还会什么！\n",
        "唐僧：好，I服了U。不如咱们吃饭先！\n"
        "悟空：早这样多好！\n"
        "\n　　（山洞里的两锅水都烧干了，还不见白儿子回来）\n"
        "白爸爸：老婆，儿子怎么还不回来？\n"
        "白妈妈：是啊，准是和北山狐狸精家的小女孩玩去了，你可该\n"
        "        好好管教一下儿子了，明年就高考了，小心早恋！\n",
        "白爸爸：你神经啊！你见过一堆白骨和一只狐狸结婚的么？\n"
        "        科幻小说啊？卫斯理啊？你省省吧。\n",
        "白妈妈：就你懂！不行，我得去找找他！\n"
        "白爸爸：哼！女人！\n"
        "白妈妈：错！应该叫女鬼！\n"
        " \n（白妈妈找来了……）\n",
        "白妈妈：各位师傅，你们刚才可看见一个小男孩经过这里么？\n"
        "唐僧  ：我们也是刚来的，我们什么也没看见。\n"
        "八戒  ：是啊！就算我们看见了一个小男孩，我们也没有杀了他呀！\n"
        "悟空  ：靠！你猪脑啊？\n"
        "八戒  ：对呀？\n"
        "沙僧  ：二师兄，你就少说两句吧。\n",
        "白妈妈：什么？（一眼看见了地上的尸体）这是谁干的？\n",
        "唐僧  ：我早就告诉过你们杀完人以后要处理好现场的，不然很\n"
        "        容易让人家抓到的。你看，让我说中了不是？\n",
        "悟空  ：闭上你的乌鸦嘴！\n"
        "白妈妈：啊！~~~~~儿子啊，你死的好惨啊！是谁杀了你呀！\n"
        "唐僧  ：不是我。\n"
        "八戒  ：不是我。\n"
        "沙僧  ：不是我。\n",
        "白妈妈：那一定就是你了！这是什么世道啊！连马都会杀人啊！\n"
        "白龙马：拜托，我让人家骑还骑不过来呢，哪有时间杀人啊？那\n"
        "        边还站着一个呢。\n",
        "白妈妈：我知道，他不就是孙悟空麽，可我打不过他呀，你就将\n"
        "        就着让我随便踹两脚解解气就行了。\n"
        "悟空  ：小心我告你虐待宠物！\n"
        "白龙马：靠！你还当我是宠物啊！你们每天吃饱喝足了，随便找\n"
        "        些草来糊弄我，其实我也是龙王三太子啊！一天到晚驮\n"
        "        着这个胖和尚走来走去的，那家是这样对宠物的？\n",
        "悟空  ：好好好，我告她虐待牲畜总可以了吧？\n"
        "白龙马：这还差不多！\n",
        "白妈妈：好了！你们也关心一下我的孩子好不好？\n"
        "悟空  ：孩子死了可以再生一个，我看你还算硬朗，老公身体也不\n"
        "        错吧？还不快回家再生一个？\n"
        "唐僧  ：悟空，你打死人家的孩子，怎么还可以这样和人家讲话？\n"
        "八戒  ：就是的。\n"
        "悟空  ：去！\n",
        "唐僧  ：要不这样吧，这是十两银子，你拿回去把儿子安葬了先。\n"
        "白妈妈：十两？打发要饭的？\n"
        "沙僧  ：施主，十两已经不少了，我挑一星期的担子才一两啊！\n"
        "白妈妈：我生个儿子也不容易，干脆一口价，二十两！\n"
        "八戒  ：抢劫啊？\n"
        "唐僧  ：十二两。\n"
        "白妈妈：十九两。\n"
        "唐僧  ：十四两。\n"
        "白妈妈：十八两。\n"
        "唐僧  ：十六两。\n"
        "白妈妈：成交！\n"
        "悟空  ：呔！吃俺老孙一棒！\n"
        "白妈妈：啊！~~~~~（死了）\n",
        "唐僧  ：悟空，人家又没有说要吃我，你怎么又开杀戒了？\n"
        "悟空  ：我最讨厌跟人家讨价还价的女人，反正也是个妖怪\n"
        "        ，又省了十六两银子，何乐而不为呢？\n"
        "唐僧  ：唔！说的有些道理，快走吧，别忘了把钱拿回来！\n"
        "\n [1;35m（终于白爸爸也等不及了，他一路追了过来……）[m\n",
        "白爸爸：你们就是去西天取经的和尚？\n"
        "唐僧  ：不错，我就是东土大唐西去取经的僧人，简称唐僧！\n"
        "白爸爸：你们几个和尚好大的胆子！竟敢伤我妻儿两条性命！\n"
        "唐僧  ：靠！一家子都来了，我真搞不懂，我就是一个和尚\n"
        "        而已，吃了我的肉怎么会长生不老呢？即便是这样，\n"
        "        这一路上的妖怪又是怎么知道的呢？\n",
        "白爸爸：你看这个！\n"
        "（众人）：啊？《西游日报》？\n"
        "白爸爸：不错，这就是天竺国发行的报纸。如来主编，你一\n"
        "        路上的妖怪都要订阅的。每天一期，你们的动态我\n"
        "        们随时掌握。\n",
        "悟空  ：如来好无聊啊？\n"
        "白爸爸：废话！要不然你们哪里来的八十一难！这样一来，\n"
        "        如来还可以当主编挣些零花，他们早就算计好了。\n"
        "        唐僧肉吃了能长生不老也是报上的广告说的呢！\n",
        "唐僧  ：骗人的啦！我要有这么厉害的肉，我自己就先吃一\n"
        "        块了，还取什么经啊！\n"
        "白爸爸：哼！你们还不是借取经的名头公费旅游嘛！\n"
        "悟空  ：什么？你有没有搞错啊！我们一路走来，却医少药\n"
        "        不说，又没有固定住处，又没有固定的收入。实在\n"
        "        不行我们摆过地摊，耍过马戏，卖过唱，卖过艺，\n"
        "        什么没有干过！你去吃屎吧你！\n",
        "白爸爸：哦？生活蛮多姿多彩的嘛！\n"
        "沙僧  ：不如你也来试试啊？\n"
        "白爸爸：好啊！反正家里也死光光了，不如我们一起走吧？\n",
        "悟空  ：对呀，多个朋友多条路，一起走吧！\n"
        "唐僧  ：那一路上岂不又多了一个人的开销？\n",
        "白爸爸：不要紧，我会烧火做饭，看孩子洗碗，收拾屋子，\n"
        "        洗衣服，刷马桶，倒痰盂，能人所不能，不会给你\n"
        "        们添麻烦的。\n",
        "沙僧  ：好啊！从今后，你就是师傅最小的徒弟了，这挑担\n"
        "        子的事就是你的了。\n,"
        "白爸爸：愿意效劳！\n"
        "\n\n[1;35m（音乐声起：你挑着担，我牵着马，迎来日出送走晚霞……）[m\n",
});  
          
